level = [
    {'image': "MainBackGround.png", 'x': 0, 'y': 0},
    {'image': "block.png", 'x': 0, 'y': 650},
    {'image': "block.png", 'x': 240, 'y': 650},
    {'image': "block.png", 'x': 480, 'y': 650},
    {'image': "block.png", 'x': 720, 'y': 650},
    {'image': "block.png", 'x': 960, 'y': 650},

    {'image': "block.png", 'x': 200, 'y': 360},
    {'image': "block.png", 'x': 520, 'y': 200},
    {'image': "block.png", 'x': 900, 'y': 300},


    #{'image': "Character1.png", 'x': 72, 'y': 470},
]

# Пример уровня (уровень 1)
level_1 = [
    # Комната 1
    [
        "#########",
        "#   E   #",
        "#       #",
        "#   P   #",
        "#       #",
        "#   K   #",
        "#       #",
        "#########",
    ],
    # Комната 2
    [
        "#########",
        "#   T   #",
        "#       #",
        "#       #",
        "#   S   #",
        "#       #",
        "#       #",
        "#########",
    ],
    # Другие комнаты уровня...
]

# Пример уровня (уровень 2)
level_2 = [
    # Комната 1
    [
        "#########",
        "#       #",
        "#       #",
        "#   P   #",
        "#       #",
        "#   K   #",
        "#       #",
        "#########",
    ],
    # Комната 2
    [
        "#########",
        "#   T   #",
        "#       #",
        "#       #",
        "#   S   #",
        "#       #",
        "#       #",
        "#########",
    ],
    # Другие комнаты уровня...
]

# # представляет стены и границы комнаты.
# E - вход в уровень.
# P - местоположение игрока.
# K - ключ.
# T - ловушка.
# S - сокровище.
levels = [level_1, level_2]

